{"format": "graph-model", "generatedBy": "2.10.1", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Acuracy_Calculation/prediction_state/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Output_layer/Weight3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}}}, {"name": "Second_layer/Weight2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "First_layer/Weight1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}}}, {"name": "First_layer/Bias1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "First_layer/Drop_out_layer/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "First_layer/Drop_out_layer/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Second_layer/Bias2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output_layer/Bias3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "First_layer/MatMul", "op": "MatMul", "input": ["X", "First_layer/Weight1"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "First_layer/add", "op": "AddV2", "input": ["First_layer/Bias1", "First_layer/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "First_layer/Relu", "op": "Relu", "input": ["First_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "First_layer/Drop_out_layer/Shape", "op": "Shape", "input": ["First_layer/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "First_layer/Drop_out_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["First_layer/Drop_out_layer/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "0"}, "seed": {"i": "404"}}}, {"name": "First_layer/Drop_out_layer/GreaterEqual", "op": "GreaterEqual", "input": ["First_layer/Drop_out_layer/random_uniform/RandomUniform", "First_layer/Drop_out_layer/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "First_layer/Drop_out_layer/Cast", "op": "Cast", "input": ["First_layer/Drop_out_layer/GreaterEqual"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "First_layer/Drop_out_layer/Mul", "op": "Mul", "input": ["First_layer/Drop_out_layer/Cast", "First_layer/Drop_out_layer/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "First_layer/Drop_out_layer/Mul_1", "op": "Mul", "input": ["First_layer/Drop_out_layer/Mul", "First_layer/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "Second_layer/MatMul", "op": "MatMul", "input": ["First_layer/Drop_out_layer/Mul_1", "Second_layer/Weight2"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Second_layer/add", "op": "AddV2", "input": ["Second_layer/Bias2", "Second_layer/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Second_layer/Relu", "op": "Relu", "input": ["Second_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output_layer/MatMul", "op": "MatMul", "input": ["Second_layer/Relu", "Output_layer/Weight3"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Output_layer/add", "op": "AddV2", "input": ["Output_layer/Bias3", "Output_layer/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output_layer/Softmax", "op": "Softmax", "input": ["Output_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Acuracy_Calculation/prediction_state", "op": "ArgMax", "input": ["Output_layer/Softmax", "Acuracy_Calculation/prediction_state/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Acuracy_Calculation/prediction_state/dimension", "shape": [], "dtype": "int32"}, {"name": "Output_layer/Weight3", "shape": [64, 10], "dtype": "float32"}, {"name": "Second_layer/Weight2", "shape": [512, 64], "dtype": "float32"}, {"name": "First_layer/Weight1", "shape": [784, 512], "dtype": "float32"}, {"name": "First_layer/Bias1", "shape": [512], "dtype": "float32"}, {"name": "First_layer/Drop_out_layer/Const", "shape": [], "dtype": "float32"}, {"name": "First_layer/Drop_out_layer/GreaterEqual/y", "shape": [], "dtype": "float32"}, {"name": "Second_layer/Bias2", "shape": [64], "dtype": "float32"}, {"name": "Output_layer/Bias3", "shape": [10], "dtype": "float32"}]}]}